Repository: railwaymen/timetable-ios
Catalog: TimeTable/SupportingFiles/*.lproj/Localizable.strings
Languages: pl

# serverconfiguration_title
source: Log In
pl: Zaloguj się

# serverconfiguration_enter_server_url
source: Enter you TimeTable server URL.
pl: Wprowadź adres serwera TimeTable.

# serverconfiguration_address_url_placeholder
source: Server address
pl: Adres serwera

# serverconfiguration_continue_btn
source: LOG IN
pl: ZALOGUJ SIĘ

# serverconfiguration_error_invalid_url
source: Given URL (%@) is invalid.
pl: Podany adres (%@) jest niepoprawny.

# credential_title
source: Log In
pl: Zaloguj się

# credential_enter_email_password
source: Please enter email and password
pl: Wprowadź email i hasło:

# credential_stay_signed_in
source: Stay signed in
pl: Pozostań zalogowany

# credential_username_placeholder
source: Username
pl: Nazwa użytkownika

# credential_password_placeholder
source: Password
pl: Hasło

# credential_log_in_btn
source: Log in
pl: Zaloguj się

# credential_error_credentials_invalid
source: The given credentials are invalid. Check if you typed it correctly.
pl: Podane dane są niepoprawne. Upewnij się, czy dobrze je wpisałeś.

# projects_title
source: Projects
pl: Projekty

# timesheet_title
source: Timesheet
pl: Czas Pracy

# timesheet_delete_alert_title
source: Delete time entry
pl: Usuń wpis

# timesheet_delete_alert_message
source: Are you sure, you want to delete the time entry?
pl: Jesteś pewien, że chcesz trwale usunąć wpis?

# timesheet_delete_alert_cancel
source: Cancel
pl: Anuluj

# timesheet_delete_alert_confirm
source: Delete permanently
pl: Usuń trwale

# timesheet_month_total
source: Month total
pl: Miesiąc ogółem

# worktimeform_new_entry_title
source: Add new entry
pl: Dodaj nowy wpis

# worktimeform_edit_entry_title
source: Edit entry
pl: Edytuj wpis

# worktimeform_what_have_you_done
source: What have you done?
pl: Nad czym pracowałeś?

# worktimeform_task_url
source: Task URL
pl: URL taska

# worktimeform_select_project
source: Select project
pl: Wybierz projekt

# worktimeform_save_btn
source: Save
pl: Zapisz

# worktimeform_save_with_filling
source: Save with filling
pl: Zapisz z wypełnieniem

# worktimeform_error_greater_than
source: Time range is invalid. Start time is greater or equal to end time.
pl: Przedział czasu jest nieprawidłowy. Czas rozpoczęcia jest większy lub równy czasowi zakończenia.

# worktimeform_error_overlap
source: There is another task done at the same time.
pl: Istnieje inne zadanie wykonane w tym samym czasie.

# worktimeform_error_invalid_uri
source: Task URL has invalid format.
pl: Niepoprawny format adresu URL.

# worktimeform_error_invalid_external
source: Task with given address URL doesn't exist.
pl: Zadanie z podanego adresu URL nie istnieje.

# worktimeform_error_too_old
source: Selected day or time is too far in the past.
pl: Już za późno, żeby dodać zadanie w tym czasie.

# worktimeform_error_no_gaps_to_fill
source: There are no gaps to fill in the given time range.
pl: Nie ma żadnych luk do wypełnienia w wybranym przedziale czasowym.

# tag_internal_meeting
source: Internal meeting
pl: Spotkanie wewnętrzne

# tag_client_communication
source: Client communication
pl: Rozmowa z klientem

# tag_research
source: Research
pl: Poszukiwanie informacji

# taskhistory_title
source: Task history
pl: Historia edycji

# profile_title
source: Profile
pl: Profil

# profile_logout_btn
source: LOG OUT
pl: WYLOGUJ

# accountingperiods_title
source: Accounting Periods
pl: Okresy rozliczeniowe

# accountingperiods_from
source: FROM
pl: OD

# accountingperiods_to
source: TO
pl: DO

# accountingperiods_hours
source: HOURS
pl: GODZINY

# accountingperiods_full_time_yes
source: full-time: Yes
pl: etat: Tak

# accountingperiods_full_time_no
source: full-time: No
pl: etat: Nie

# vacation_title
source: Vacation
pl: Urlopy

# vacation_used_days_title
source: Used vacation
pl: Wykorzystany urlop

# vacation_status_unconfirmed
source: Unconfirmed
pl: Niepotwierdzone

# vacation_status_declined
source: Declined
pl: Odrzucony

# vacation_status_approved
source: Unconfirmed
pl: Niepotwierdzone

# vacation_status_accepted
source: Accepted
pl: Zaakceptowany

# vacation_type_planned
source: Holiday leave
pl: Urlop wypoczynkowy

# vacation_type_requested
source: Leave on demand
pl: Urlop na żądanie

# vacation_type_compassionate
source: Special leave
pl: Urlop okolicznościowy

# vacation_type_others
source: Others
pl: Inne

# vacation_remaining_vacation
source: Remaining vacation:
pl: Pozostały urlop:

# vacation_more_used_days
source: More about used days
pl: Sprawdź wykorzystany urlop

# vacation_history
source: History
pl: Historia

# vacation_type_paternity
source: Paternity leave
pl: Urlop ojcowski

# vacation_type_parental
source: Parental leave
pl: Urlop macierzyński

# vacation_type_upbringing
source: Upbringing leave
pl: Urlop wychowawczy

# vacation_type_unpaid
source: Unpaid leave
pl: Urlop bezpłatny

# vacation_type_rehabilitation
source: Rehabilitation leave
pl: Urlop rehabilitacyjny

# vacation_type_illness
source: Illness
pl: Urlop chorobowy

# vacation_type_care
source: Care
pl: Urlop opiekuńczy

# error_cannot_be_empty
source: Field cannot be empty.
pl: Pole nie może być puste.

# error_invalid_format
source: Content has invalid format.
pl: Wartość ma niepoprawny format.

# error_something_went_wrong
source: Oups! We couldn't finish your request. Please, try again later.
pl: Ups! Niestety nie mogliśmy zrealizować twojego żądania. Spróbuj później.

# error_invalid_parameters
source: Invalid parameters were sent.
pl: Wysłano nieprawidłowe parametry.

# error_invalid_response
source: Invalid server response.
pl: Niepoprawna odpowiedź serwera.

# error_no_connection
source: No internet connection. To perform further operations, please connect to the internet.
pl: Brak połączenia z internetem. Aby kontynuować połącz sie z siecią.

# error_timeout
source: Your request has timed out. Please, check your internet connection and try again.
pl: Twoje żądanie przekroczyło limit czasu i zostało przerwane. Sprawdź połączenie z internetem i spróbuj ponownie.

# error_unauthorized
source: Your session has timed out.
pl: Twoja sesja wygasła.

# error_refresh_btn
source: REFRESH
pl: ODŚWIEŻ
